def decode_dongchedi_list_sh_price(text: str) -> str:
    """
    Преобразует строку цены из поля sh_price, заменяя спецсимволы на цифры и единицы измерения.
    """
    if not text:
        return ''
    mapping = {
        '\ue54c': '1',
        '\ue463': '2',
        '\ue49d': '3',
        '\ue41d': '4',  # Не подтверждено
        '\ue411': '5',
        '\ue534': '6',
        '\ue3eb': '7',
        '\ue4e3': '8',
        '\ue45d': '9',
        '\ue439': '0',
        '\ue40a': ' mln youan',
    }
    result = ''
    for char in text:
        result += mapping.get(char, char)
    return result


def decode_dongchedi_detail(text: str) -> str:
    """
    Преобразует строку с символами из диапазона спецсимволов (например, U+E3E8)
    в читаемые символы, согласно предоставленной таблице соответствий. Для 
    """
    if not text:
        return ''

    mapping = {
        '\ue3e8': '日', '\ue3e9': 'i', '\ue3ea': '叫', '\ue3eb': '妈',
        '\ue3ec': '音', '\ue3ed': 'l', '\ue3ee': '于', '\ue3ef': '至',
        '\ue3f0': '2', '\ue3f1': '这', '\ue3f2': '英', '\ue3f4': '老',
        '\ue3f5': '放', '\ue3f6': '门', '\ue3f7': '往', '\ue3f8': '利',
        '\ue3f9': '使', '\ue3fa': 'p', '\ue3fb': '从', '\ue3fc': '向',
        '\ue3fd': '更', '\ue3fe': '代', '\ue3ff': '直', '\ue400': '先',
        '\ue401': '地', '\ue402': '德', '\ue403': '再', '\ue404': '问',
        '\ue405': 'Q', '\ue406': '太', '\ue407': '死', '\ue408': 'e',
        '\ue409': '表', '\ue40a': '世', '\ue40b': '员', '\ue40c': '儿',
        '\ue40d': '了', '\ue40e': 'O', '\ue40f': '女', '\ue410': '而',
        '\ue411': '三', '\ue412': '字', '\ue413': 'd', '\ue414': '或',
        '\ue415': '月', '\ue416': '任', '\ue417': '家', '\ue418': '所',
        '\ue419': 'R', '\ue41a': '家', '\ue41b': '说', '\ue41c': '民',
        '\ue41d': '风', '\ue41e': '得', '\ue41f': '张', '\ue420': '满',
        '\ue421': '作', '\ue422': '3', '\ue423': '子', '\ue424': '没',
        '\ue425': '几', '\ue426': '神', '\ue427': '事', '\ue428': '口',
        '\ue429': '行', '\ue42b': '6', '\ue42c': '4', '\ue42d': '十',
        '\ue42e': '东', '\ue42f': '见', '\ue430': '理', '\ue431': '认',
        '\ue432': '些', '\ue433': '工', '\ue434': 'v', '\ue435': '为',
        '\ue436': '本', '\ue437': 'u', '\ue438': 'Y', '\ue439': '身',
        '\ue43a': 'q', '\ue43b': '第', '\ue43c': '像', '\ue43d': '开',
        '\ue43e': '何', '\ue43f': '天', '\ue440': '高', '\ue441': '时',
        '\ue442': '边', '\ue443': '外', '\ue444': '内', '\ue445': '快',
        '\ue446': 'C', '\ue447': '相', '\ue448': '么', '\ue44a': '如',
        '\ue44b': '写', '\ue44c': '机', '\ue44d': '关', '\ue44e': '分',
        '\ue44f': '其', '\ue450': '那', '\ue451': '法', '\ue452': '体',
        '\ue453': '0', '\ue454': 'U', '\ue455': '花', '\ue456': '面',
        '\ue457': '用', '\ue458': '可', '\ue45a': '次', '\ue45b': '多',
        '\ue45c': 'F', '\ue45d': 'P', '\ue45e': '成', '\ue45f': '万',
        '\ue460': '眼', '\ue461': '对', '\ue462': 'c', '\ue463': '路',
        '\ue465': '美', '\ue466': '极', '\ue467': '师', '\ue468': '期',
        '\ue469': '种', '\ue46a': '夫', '\ue46b': '会', '\ue46c': 'k',
        '\ue46d': 'Z', '\ue46e': '别', '\ue46f': '能', '\ue470': '加',
        '\ue472': '命', '\ue473': '都', '\ue474': 'L', '\ue475': '什',
        '\ue476': '车', '\ue477': '走', '\ue478': '你', '\ue479': 'X',
        '\ue47a': '道', '\ue47b': '西', '\ue47c': '后', '\ue47d': '有',
        '\ue47e': '己', '\ue47f': '友', '\ue481': '长', '\ue482': '要',
        '\ue483': '果', '\ue484': '四', '\ue485': '年', '\ue486': '看',
        '\ue487': '的', '\ue488': 'W', '\ue489': '间', '\ue48a': 'M',
        '\ue48b': '经', '\ue48c': '力', '\ue48d': '处', '\ue48e': '界',
        '\ue48f': '它', '\ue490': 't', '\ue491': '起', '\ue492': '由',
        '\ue493': '亲', '\ue494': '结', '\ue495': '文', '\ue496': '应',
        '\ue497': '当', '\ue498': '不', '\ue499': '斯', '\ue49a': '却',
        '\ue49b': '宽', '\ue49c': '5', '\ue49d': '便', '\ue49e': 'r',
        '\ue49f': '大', '\ue4a0': '变', '\ue4a1': '许', '\ue4a2': '轻',
        '\ue4a3': 'D', '\ue4a4': '父', '\ue4a5': '重', '\ue4a6': '接',
        '\ue4a7': '望', '\ue4a8': '马', '\ue4a9': 's', '\ue4aa': '字',
        '\ue4ab': 'a', '\ue4ac': 'm', '\ue4ad': '还', '\ue4ae': '点',
        '\ue4af': '场', '\ue4b0': '国', '\ue4b1': '他', '\ue4b2': '男',
        '\ue4b3': '个', '\ue4b4': '给', '\ue4b5': '活', '\ue4b6': '回',
        '\ue4b7': '和', '\ue4b8': '物', '\ue4b9': 'y', '\ue4ba': '已',
        '\ue4bb': '战', '\ue4bc': '岁', '\ue4bd': '正', '\ue4be': '立',
        '\ue4bf': 'n', '\ue4c0': '乐', '\ue4c1': '我', '\ue4c2': '主',
        '\ue4c3': '名', '\ue4c4': '定', '\ue4c5': '情', '\ue4c6': 'T',
        '\ue4c7': '头', '\ue4c8': '9', '\ue4c9': '拉', '\ue4ca': '远',
        '\ue4cb': '带', '\ue4cc': '才', '\ue4cd': '声', '\ue4ce': '安',
        '\ue4cf': '之', '\ue4d0': '孩', '\ue4d2': 'A', '\ue4d3': '做',
        '\ue4d4': 'K', '\ue4d5': '以', '\ue4d6': 'g', '\ue4d7': '尔',
        '\ue4d8': '是', '\ue4d9': '真', '\ue4da': '失', '\ue4db': '信',
        '\ue4dc': '把', '\ue4dd': '立', '\ue4de': '们', '\ue4df': '很',
        '\ue4e0': '车', '\ue4e1': '想', '\ue4e2': 'G', '\ue4e3': '心',
        '\ue4e4': '手', '\ue4e5': '打', '\ue4e7': '感', '\ue4e8': '格',
        '\ue4e9': '两', '\ue4ea': '少', '\ue4eb': '案', '\ue4ec': 'E',
        '\ue4ed': '吃', '\ue4ee': '候', '\ue4ef': '特', '\ue4f0': '度',
        '\ue4f1': '并', '\ue4f2': 'w', '\ue4f3': '解', '\ue4f4': '常',
        '\ue4f5': '无', '\ue4f6': '出', '\ue4f7': '每', '\ue4f8': '爱',
        '\ue4f9': '任', '\ue4fa': '一', '\ue4fb': '中', '\ue4fc': '里',
        '\ue4fd': '着', '\ue4fe': '7', '\ue4ff': 'z', '\ue500': '动',
        '\ue501': '呢', '\ue502': '生', '\ue503': '又', '\ue504': '前',
        '\ue505': '山', '\ue507': 'o', '\ue508': '总', '\ue509': 'x',
        '\ue50a': 'b', '\ue50b': '因', '\ue50c': '告', '\ue50d': '过',
        '\ue50e': '去', '\ue50f': '小', '\ue510': 'N', '\ue511': '部',
        '\ue512': '气', '\ue513': 'l', '\ue514': 'j', '\ue515': '知',
        '\ue516': '在', '\ue517': '目', '\ue518': 'H', '\ue519': '教',
        '\ue51a': '将', '\ue51b': '白', '\ue51c': '明', '\ue51d': '新',
        '\ue51e': '色', '\ue51f': '原', '\ue520': '等', '\ue521': '平',
        '\ue522': '笑', '\ue523': 'J', '\ue524': '最', '\ue525': '海',
        '\ue526': '让', '\ue527': 'f', '\ue528': '克', '\ue529': '但',
        '\ue52a': '方', '\ue52b': '到', '\ue52c': '好', '\ue52d': '母',
        '\ue52e': '现', '\ue52f': '她', '\ue530': '士', '\ue531': '公',
        '\ue532': '生', '\ue533': '水', '\ue534': '比', '\ue535': '只',
        '\ue536': '也', '\ue537': '意', '\ue538': 'V', '\ue539': '数',
        '\ue53a': '性', '\ue53b': '就', '\ue53c': '发', '\ue53d': '1',
        '\ue53e': '上', '\ue53f': '稜', '\ue540': 'S', '\ue541': '进',
        '\ue542': '听', '\ue543': '人', '\ue544': '全', '\ue545': 'h',
        '\ue546': '光', '\ue547': '话', '\ue548': '8', '\ue549': '者',
        '\ue54a': 'B', '\ue54b': '通', '\ue54c': '难', '\ue54d': '样',
        '\ue54e': '金', '\ue54f': '此', '\ue550': '实', '\ue551': '同',
        '\ue552': '然', '\ue553': '与', '\ue554': '入', '\ue555': '记',
        '\ue556': '报', '\ue557': '自', '\ue558': '下', '\ue559': '来',
        '\ue55a': '受', '\ue55b': '电',
    }

    return ''.join(mapping.get(char, char) for char in text)
